tutorials/icoDyMFoam/movingBlockRBF/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 1;

vertices        
(
    (-12.5 -12.5 -0.5)
    ( -2.5 -12.5 -0.5)
    (  2.5 -12.5 -0.5)
    ( 12.5 -12.5 -0.5)

    (-12.5  -0.5 -0.5)
    ( -2.5  -0.5 -0.5)
    (  2.5  -0.5 -0.5)
    ( 12.5  -0.5 -0.5)

    (-12.5   0.5 -0.5)
    ( -2.5   0.5 -0.5)
    (  2.5   0.5 -0.5)
    ( 12.5   0.5 -0.5)

    (-12.5  12.5 -0.5)
    ( -2.5  12.5 -0.5)
    (  2.5  12.5 -0.5)
    ( 12.5  12.5 -0.5)

    (-12.5 -12.5  0.5)
    ( -2.5 -12.5  0.5)
    (  2.5 -12.5  0.5)
    ( 12.5 -12.5  0.5)

    (-12.5  -0.5  0.5)
    ( -2.5  -0.5  0.5)
    (  2.5  -0.5  0.5)
    ( 12.5  -0.5  0.5)

    (-12.5   0.5  0.5)
    ( -2.5   0.5  0.5)
    (  2.5   0.5  0.5)
    ( 12.5   0.5  0.5)

    (-12.5  12.5  0.5)
    ( -2.5  12.5  0.5)
    (  2.5  12.5  0.5)
    ( 12.5  12.5  0.5)
);

blocks          
(
    hex (0 1 5 4 16 17 21 20) (10 12 1) simpleGrading (1 1 1)
    hex (1 2 6 5 17 18 22 21) (5 12 1) simpleGrading (1 1 1)
    hex (2 3 7 6 18 19 23 22) (10 12 1) simpleGrading (1 1 1)

    hex (4 5 9 8 20 21 25 24) (10 1 1) simpleGrading (1 1 1)
    hex (6 7 11 10 22 23 27 26) (10 1 1) simpleGrading (1 1 1)

    hex (8 9 13 12 24 25 29 28) (10 12 1) simpleGrading (1 1 1)
    hex (9 10 14 13 25 26 30 29) (5 12 1) simpleGrading (1 1 1)
    hex (10 11 15 14 26 27 31 30) (10 12 1) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    wall block
    (
        (5 21 22 6)
        (6 22 26 10)
        (9 10 26 25)
        (5 9 25 21)
    )
    
    wall top
    (
        (12 28 29 13)
        (13 29 30 14)
        (14 30 31 15)
    )
    
    wall bottom 
    (
        (0 1 17 16)
        (1 2 18 17)
        (2 3 19 18)
    )

    wall left
    (
        (0 16 20 4)
        (4 20 24 8)
        (8 24 28 12)
    )

    wall right
    (
        (3 7 23 19)
        (7 11 27 23)
        (11 15 31 27)
    )
);

mergePatchPairs 
(
);


// ************************************************************************* //
